*** 'e' is dropped
#+begin_src bsh.dash :results verbatim :exports both :wrap example
cd ~/code/data/sharif_course_list || return $?
ll | rtl_reshaper_rs | sponge | ghead -n 15
#+end_src

#+RESULTS:
#+begin_example
drwxr-xr-x    - evar 16 Mar 18:47 .git
.rw-r--r--   18 evar 11 Oct  2020 .gitignore
drwxr-xr-x    - evar 10 Oct  2020 .hidden
.rw-r--r--  29k evar 10 Oct  2020 default.css
.rw-r--r--  40k evar 19 Feb  0:19 index.html
.rw-r--r-- 2.0k evar 11 Oct  2020 readme.md
.rw-r--r--  39k evar 11 Oct  2020 tmp.html
.rw-r--r--  24k evar 11 Oct  2020 tmp.json
.rw-r--r--  276 evar 19 Feb  0:18 ﯼﮊﺮﻧﺍ ﻭ ﺏﺁ.html
.rw-r--r--    3 evar 19 Feb  0:18 ﯼﮊﺮﻧﺍ ﻭ ﺏﺁ.json
.rw-r--r--  276 evar 19 Feb  0:18 ﯽﻤﯿﺷﻮﯿﺑ.html
.rw-r--r--    3 evar 19 Feb  0:18 ﯽﻤﯿﺷﻮﯿﺑ.json
.rw-r--r--  276 evar 19 Feb  4:36 ﻥﺍﺮﻬﺗ ﺲﯾﺩﺮﭘ( ﯽﻣﻮﻤﻋ ﻭ ﻪﯾﺎﭘ ﺱﻭﺭﺩ).html
.rw-r--r--    3 evar 19 Feb  4:36 ﻥﺍﺮﻬﺗ ﺲﯾﺩﺮﭘ( ﯽﻣﻮﻤﻋ ﻭ ﻪﯾﺎﭘ ﺱﻭﺭﺩ).json
.rw-r--r--  58k evar 19 Feb  4:40 ﺶﯿﮐ ﺲﯾﺩﺮﭘ( ﯽﻣﻮﻤﻋ ﻭ ﻪﯾﺎﭘ ﺱﻭﺭﺩ).html
#+end_example

#+begin_src bsh.dash :results verbatim :exports both :wrap example
cd ~/code/data/sharif_course_list || return $?
ll | rtl_reshaper.py | sponge | ghead -n 15
#+end_src

#+RESULTS:
#+begin_example
drwxr-xr-x    - evar 16 Mar 18:47 .git
.rw-r--r--   18 evar 11 Oct  2020 .gitignore
drwxr-xr-x    - evar 10 Oct  2020 .hidden
.rw-r--r--  29k evar 10 Oct  2020 default.css
.rw-r--r--  40k evar 19 Feb  0:19 index.html
.rw-r--r-- 2.0k evar 11 Oct  2020 readme.md
.rw-r--r--  39k evar 11 Oct  2020 tmp.html
.rw-r--r--  24k evar 11 Oct  2020 tmp.json
.rw-r--r--  276 evar 19 Feb  0:18 ﯼﮊﺮﻧﺍ ﻭ ﺏﺁ.html
.rw-r--r--    3 evar 19 Feb  0:18 ﯼﮊﺮﻧﺍ ﻭ ﺏﺁ.json
.rw-r--r--  276 evar 19 Feb  0:18 ﯽﻤﯿﺷﻮﯿﺑ.html
.rw-r--r--    3 evar 19 Feb  0:18 ﯽﻤﯿﺷﻮﯿﺑ.json
.rw-r--r--  276 evar 19 Feb  4:36 ﻥﺍﺮﻬﺗ ﺲﯾﺩﺮﭘ) ﯽﻣﻮﻤﻋ ﻭ ﻪﯾﺎﭘ ﺱﻭﺭﺩ).html
.rw-r--r--    3 evar 19 Feb  4:36 ﻥﺍﺮﻬﺗ ﺲﯾﺩﺮﭘ) ﯽﻣﻮﻤﻋ ﻭ ﻪﯾﺎﭘ ﺱﻭﺭﺩ).json
.rw-r--r--  58k evar 19 Feb  4:40 ﺶﯿﮐ ﺲﯾﺩﺮﭘ) ﯽﻣﻮﻤﻋ ﻭ ﻪﯾﺎﭘ ﺱﻭﺭﺩ).html
#+end_example
